# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.12-s068_1 on Tue Jun 02 19:39:04 -03 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design busca_padrao

create_clock -name "Bus2IP_Clk" -period 2.0 -waveform {0.0 1.0} [get_ports Bus2IP_Clk]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[7]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[7]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[6]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[6]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[5]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[5]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[4]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[4]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[3]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[3]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[2]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[2]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[1]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[1]}]
set_load -pin_load -min 0.0014 [get_ports {IP2Bus_Data[0]}]
set_load -pin_load -max 0.32 [get_ports {IP2Bus_Data[0]}]
set_load -pin_load -min 0.0014 [get_ports user_int]
set_load -pin_load -max 0.32 [get_ports user_int]
set_false_path -from [get_ports Bus2IP_Reset]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports Bus2IP_Reset]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[7]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[6]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[5]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[4]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[3]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[2]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[1]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_Data[0]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[0]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[1]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[2]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[3]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[4]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[5]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[6]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[7]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[8]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[9]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[10]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[11]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[12]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[13]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_RdCE[14]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[0]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[1]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[2]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[3]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[4]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[5]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[6]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[7]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[8]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[9]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[10]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[11]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[12]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[13]}]
set_input_delay -clock [get_clocks Bus2IP_Clk] -add_delay -max 0.2 [get_ports {Bus2IP_WrCE[14]}]
set_input_transition -min 0.003 [get_ports Bus2IP_Clk]
set_input_transition -max 0.16 [get_ports Bus2IP_Clk]
set_input_transition -min 0.003 [get_ports Bus2IP_Reset]
set_input_transition -max 0.16 [get_ports Bus2IP_Reset]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[7]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[7]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[6]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[6]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[5]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[5]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[4]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[4]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[3]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[3]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[2]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[2]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[1]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[1]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_Data[0]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_Data[0]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[0]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[0]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[1]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[1]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[2]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[2]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[3]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[3]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[4]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[4]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[5]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[5]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[6]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[6]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[7]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[7]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[8]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[8]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[9]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[9]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[10]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[10]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[11]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[11]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[12]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[12]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[13]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[13]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_RdCE[14]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_RdCE[14]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[0]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[0]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[1]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[1]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[2]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[2]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[3]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[3]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[4]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[4]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[5]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[5]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[6]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[6]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[7]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[7]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[8]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[8]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[9]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[9]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[10]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[10]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[11]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[11]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[12]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[12]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[13]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[13]}]
set_input_transition -min 0.003 [get_ports {Bus2IP_WrCE[14]}]
set_input_transition -max 0.16 [get_ports {Bus2IP_WrCE[14]}]
