# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.12-s068_1 on Tue Jun 16 20:14:29 -03 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design multiplier_param_N64

create_clock -name "clk" -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_load -pin_load -min 0.0014 [get_ports {out[127]}]
set_load -pin_load -max 0.32 [get_ports {out[127]}]
set_load -pin_load -min 0.0014 [get_ports {out[126]}]
set_load -pin_load -max 0.32 [get_ports {out[126]}]
set_load -pin_load -min 0.0014 [get_ports {out[125]}]
set_load -pin_load -max 0.32 [get_ports {out[125]}]
set_load -pin_load -min 0.0014 [get_ports {out[124]}]
set_load -pin_load -max 0.32 [get_ports {out[124]}]
set_load -pin_load -min 0.0014 [get_ports {out[123]}]
set_load -pin_load -max 0.32 [get_ports {out[123]}]
set_load -pin_load -min 0.0014 [get_ports {out[122]}]
set_load -pin_load -max 0.32 [get_ports {out[122]}]
set_load -pin_load -min 0.0014 [get_ports {out[121]}]
set_load -pin_load -max 0.32 [get_ports {out[121]}]
set_load -pin_load -min 0.0014 [get_ports {out[120]}]
set_load -pin_load -max 0.32 [get_ports {out[120]}]
set_load -pin_load -min 0.0014 [get_ports {out[119]}]
set_load -pin_load -max 0.32 [get_ports {out[119]}]
set_load -pin_load -min 0.0014 [get_ports {out[118]}]
set_load -pin_load -max 0.32 [get_ports {out[118]}]
set_load -pin_load -min 0.0014 [get_ports {out[117]}]
set_load -pin_load -max 0.32 [get_ports {out[117]}]
set_load -pin_load -min 0.0014 [get_ports {out[116]}]
set_load -pin_load -max 0.32 [get_ports {out[116]}]
set_load -pin_load -min 0.0014 [get_ports {out[115]}]
set_load -pin_load -max 0.32 [get_ports {out[115]}]
set_load -pin_load -min 0.0014 [get_ports {out[114]}]
set_load -pin_load -max 0.32 [get_ports {out[114]}]
set_load -pin_load -min 0.0014 [get_ports {out[113]}]
set_load -pin_load -max 0.32 [get_ports {out[113]}]
set_load -pin_load -min 0.0014 [get_ports {out[112]}]
set_load -pin_load -max 0.32 [get_ports {out[112]}]
set_load -pin_load -min 0.0014 [get_ports {out[111]}]
set_load -pin_load -max 0.32 [get_ports {out[111]}]
set_load -pin_load -min 0.0014 [get_ports {out[110]}]
set_load -pin_load -max 0.32 [get_ports {out[110]}]
set_load -pin_load -min 0.0014 [get_ports {out[109]}]
set_load -pin_load -max 0.32 [get_ports {out[109]}]
set_load -pin_load -min 0.0014 [get_ports {out[108]}]
set_load -pin_load -max 0.32 [get_ports {out[108]}]
set_load -pin_load -min 0.0014 [get_ports {out[107]}]
set_load -pin_load -max 0.32 [get_ports {out[107]}]
set_load -pin_load -min 0.0014 [get_ports {out[106]}]
set_load -pin_load -max 0.32 [get_ports {out[106]}]
set_load -pin_load -min 0.0014 [get_ports {out[105]}]
set_load -pin_load -max 0.32 [get_ports {out[105]}]
set_load -pin_load -min 0.0014 [get_ports {out[104]}]
set_load -pin_load -max 0.32 [get_ports {out[104]}]
set_load -pin_load -min 0.0014 [get_ports {out[103]}]
set_load -pin_load -max 0.32 [get_ports {out[103]}]
set_load -pin_load -min 0.0014 [get_ports {out[102]}]
set_load -pin_load -max 0.32 [get_ports {out[102]}]
set_load -pin_load -min 0.0014 [get_ports {out[101]}]
set_load -pin_load -max 0.32 [get_ports {out[101]}]
set_load -pin_load -min 0.0014 [get_ports {out[100]}]
set_load -pin_load -max 0.32 [get_ports {out[100]}]
set_load -pin_load -min 0.0014 [get_ports {out[99]}]
set_load -pin_load -max 0.32 [get_ports {out[99]}]
set_load -pin_load -min 0.0014 [get_ports {out[98]}]
set_load -pin_load -max 0.32 [get_ports {out[98]}]
set_load -pin_load -min 0.0014 [get_ports {out[97]}]
set_load -pin_load -max 0.32 [get_ports {out[97]}]
set_load -pin_load -min 0.0014 [get_ports {out[96]}]
set_load -pin_load -max 0.32 [get_ports {out[96]}]
set_load -pin_load -min 0.0014 [get_ports {out[95]}]
set_load -pin_load -max 0.32 [get_ports {out[95]}]
set_load -pin_load -min 0.0014 [get_ports {out[94]}]
set_load -pin_load -max 0.32 [get_ports {out[94]}]
set_load -pin_load -min 0.0014 [get_ports {out[93]}]
set_load -pin_load -max 0.32 [get_ports {out[93]}]
set_load -pin_load -min 0.0014 [get_ports {out[92]}]
set_load -pin_load -max 0.32 [get_ports {out[92]}]
set_load -pin_load -min 0.0014 [get_ports {out[91]}]
set_load -pin_load -max 0.32 [get_ports {out[91]}]
set_load -pin_load -min 0.0014 [get_ports {out[90]}]
set_load -pin_load -max 0.32 [get_ports {out[90]}]
set_load -pin_load -min 0.0014 [get_ports {out[89]}]
set_load -pin_load -max 0.32 [get_ports {out[89]}]
set_load -pin_load -min 0.0014 [get_ports {out[88]}]
set_load -pin_load -max 0.32 [get_ports {out[88]}]
set_load -pin_load -min 0.0014 [get_ports {out[87]}]
set_load -pin_load -max 0.32 [get_ports {out[87]}]
set_load -pin_load -min 0.0014 [get_ports {out[86]}]
set_load -pin_load -max 0.32 [get_ports {out[86]}]
set_load -pin_load -min 0.0014 [get_ports {out[85]}]
set_load -pin_load -max 0.32 [get_ports {out[85]}]
set_load -pin_load -min 0.0014 [get_ports {out[84]}]
set_load -pin_load -max 0.32 [get_ports {out[84]}]
set_load -pin_load -min 0.0014 [get_ports {out[83]}]
set_load -pin_load -max 0.32 [get_ports {out[83]}]
set_load -pin_load -min 0.0014 [get_ports {out[82]}]
set_load -pin_load -max 0.32 [get_ports {out[82]}]
set_load -pin_load -min 0.0014 [get_ports {out[81]}]
set_load -pin_load -max 0.32 [get_ports {out[81]}]
set_load -pin_load -min 0.0014 [get_ports {out[80]}]
set_load -pin_load -max 0.32 [get_ports {out[80]}]
set_load -pin_load -min 0.0014 [get_ports {out[79]}]
set_load -pin_load -max 0.32 [get_ports {out[79]}]
set_load -pin_load -min 0.0014 [get_ports {out[78]}]
set_load -pin_load -max 0.32 [get_ports {out[78]}]
set_load -pin_load -min 0.0014 [get_ports {out[77]}]
set_load -pin_load -max 0.32 [get_ports {out[77]}]
set_load -pin_load -min 0.0014 [get_ports {out[76]}]
set_load -pin_load -max 0.32 [get_ports {out[76]}]
set_load -pin_load -min 0.0014 [get_ports {out[75]}]
set_load -pin_load -max 0.32 [get_ports {out[75]}]
set_load -pin_load -min 0.0014 [get_ports {out[74]}]
set_load -pin_load -max 0.32 [get_ports {out[74]}]
set_load -pin_load -min 0.0014 [get_ports {out[73]}]
set_load -pin_load -max 0.32 [get_ports {out[73]}]
set_load -pin_load -min 0.0014 [get_ports {out[72]}]
set_load -pin_load -max 0.32 [get_ports {out[72]}]
set_load -pin_load -min 0.0014 [get_ports {out[71]}]
set_load -pin_load -max 0.32 [get_ports {out[71]}]
set_load -pin_load -min 0.0014 [get_ports {out[70]}]
set_load -pin_load -max 0.32 [get_ports {out[70]}]
set_load -pin_load -min 0.0014 [get_ports {out[69]}]
set_load -pin_load -max 0.32 [get_ports {out[69]}]
set_load -pin_load -min 0.0014 [get_ports {out[68]}]
set_load -pin_load -max 0.32 [get_ports {out[68]}]
set_load -pin_load -min 0.0014 [get_ports {out[67]}]
set_load -pin_load -max 0.32 [get_ports {out[67]}]
set_load -pin_load -min 0.0014 [get_ports {out[66]}]
set_load -pin_load -max 0.32 [get_ports {out[66]}]
set_load -pin_load -min 0.0014 [get_ports {out[65]}]
set_load -pin_load -max 0.32 [get_ports {out[65]}]
set_load -pin_load -min 0.0014 [get_ports {out[64]}]
set_load -pin_load -max 0.32 [get_ports {out[64]}]
set_load -pin_load -min 0.0014 [get_ports {out[63]}]
set_load -pin_load -max 0.32 [get_ports {out[63]}]
set_load -pin_load -min 0.0014 [get_ports {out[62]}]
set_load -pin_load -max 0.32 [get_ports {out[62]}]
set_load -pin_load -min 0.0014 [get_ports {out[61]}]
set_load -pin_load -max 0.32 [get_ports {out[61]}]
set_load -pin_load -min 0.0014 [get_ports {out[60]}]
set_load -pin_load -max 0.32 [get_ports {out[60]}]
set_load -pin_load -min 0.0014 [get_ports {out[59]}]
set_load -pin_load -max 0.32 [get_ports {out[59]}]
set_load -pin_load -min 0.0014 [get_ports {out[58]}]
set_load -pin_load -max 0.32 [get_ports {out[58]}]
set_load -pin_load -min 0.0014 [get_ports {out[57]}]
set_load -pin_load -max 0.32 [get_ports {out[57]}]
set_load -pin_load -min 0.0014 [get_ports {out[56]}]
set_load -pin_load -max 0.32 [get_ports {out[56]}]
set_load -pin_load -min 0.0014 [get_ports {out[55]}]
set_load -pin_load -max 0.32 [get_ports {out[55]}]
set_load -pin_load -min 0.0014 [get_ports {out[54]}]
set_load -pin_load -max 0.32 [get_ports {out[54]}]
set_load -pin_load -min 0.0014 [get_ports {out[53]}]
set_load -pin_load -max 0.32 [get_ports {out[53]}]
set_load -pin_load -min 0.0014 [get_ports {out[52]}]
set_load -pin_load -max 0.32 [get_ports {out[52]}]
set_load -pin_load -min 0.0014 [get_ports {out[51]}]
set_load -pin_load -max 0.32 [get_ports {out[51]}]
set_load -pin_load -min 0.0014 [get_ports {out[50]}]
set_load -pin_load -max 0.32 [get_ports {out[50]}]
set_load -pin_load -min 0.0014 [get_ports {out[49]}]
set_load -pin_load -max 0.32 [get_ports {out[49]}]
set_load -pin_load -min 0.0014 [get_ports {out[48]}]
set_load -pin_load -max 0.32 [get_ports {out[48]}]
set_load -pin_load -min 0.0014 [get_ports {out[47]}]
set_load -pin_load -max 0.32 [get_ports {out[47]}]
set_load -pin_load -min 0.0014 [get_ports {out[46]}]
set_load -pin_load -max 0.32 [get_ports {out[46]}]
set_load -pin_load -min 0.0014 [get_ports {out[45]}]
set_load -pin_load -max 0.32 [get_ports {out[45]}]
set_load -pin_load -min 0.0014 [get_ports {out[44]}]
set_load -pin_load -max 0.32 [get_ports {out[44]}]
set_load -pin_load -min 0.0014 [get_ports {out[43]}]
set_load -pin_load -max 0.32 [get_ports {out[43]}]
set_load -pin_load -min 0.0014 [get_ports {out[42]}]
set_load -pin_load -max 0.32 [get_ports {out[42]}]
set_load -pin_load -min 0.0014 [get_ports {out[41]}]
set_load -pin_load -max 0.32 [get_ports {out[41]}]
set_load -pin_load -min 0.0014 [get_ports {out[40]}]
set_load -pin_load -max 0.32 [get_ports {out[40]}]
set_load -pin_load -min 0.0014 [get_ports {out[39]}]
set_load -pin_load -max 0.32 [get_ports {out[39]}]
set_load -pin_load -min 0.0014 [get_ports {out[38]}]
set_load -pin_load -max 0.32 [get_ports {out[38]}]
set_load -pin_load -min 0.0014 [get_ports {out[37]}]
set_load -pin_load -max 0.32 [get_ports {out[37]}]
set_load -pin_load -min 0.0014 [get_ports {out[36]}]
set_load -pin_load -max 0.32 [get_ports {out[36]}]
set_load -pin_load -min 0.0014 [get_ports {out[35]}]
set_load -pin_load -max 0.32 [get_ports {out[35]}]
set_load -pin_load -min 0.0014 [get_ports {out[34]}]
set_load -pin_load -max 0.32 [get_ports {out[34]}]
set_load -pin_load -min 0.0014 [get_ports {out[33]}]
set_load -pin_load -max 0.32 [get_ports {out[33]}]
set_load -pin_load -min 0.0014 [get_ports {out[32]}]
set_load -pin_load -max 0.32 [get_ports {out[32]}]
set_load -pin_load -min 0.0014 [get_ports {out[31]}]
set_load -pin_load -max 0.32 [get_ports {out[31]}]
set_load -pin_load -min 0.0014 [get_ports {out[30]}]
set_load -pin_load -max 0.32 [get_ports {out[30]}]
set_load -pin_load -min 0.0014 [get_ports {out[29]}]
set_load -pin_load -max 0.32 [get_ports {out[29]}]
set_load -pin_load -min 0.0014 [get_ports {out[28]}]
set_load -pin_load -max 0.32 [get_ports {out[28]}]
set_load -pin_load -min 0.0014 [get_ports {out[27]}]
set_load -pin_load -max 0.32 [get_ports {out[27]}]
set_load -pin_load -min 0.0014 [get_ports {out[26]}]
set_load -pin_load -max 0.32 [get_ports {out[26]}]
set_load -pin_load -min 0.0014 [get_ports {out[25]}]
set_load -pin_load -max 0.32 [get_ports {out[25]}]
set_load -pin_load -min 0.0014 [get_ports {out[24]}]
set_load -pin_load -max 0.32 [get_ports {out[24]}]
set_load -pin_load -min 0.0014 [get_ports {out[23]}]
set_load -pin_load -max 0.32 [get_ports {out[23]}]
set_load -pin_load -min 0.0014 [get_ports {out[22]}]
set_load -pin_load -max 0.32 [get_ports {out[22]}]
set_load -pin_load -min 0.0014 [get_ports {out[21]}]
set_load -pin_load -max 0.32 [get_ports {out[21]}]
set_load -pin_load -min 0.0014 [get_ports {out[20]}]
set_load -pin_load -max 0.32 [get_ports {out[20]}]
set_load -pin_load -min 0.0014 [get_ports {out[19]}]
set_load -pin_load -max 0.32 [get_ports {out[19]}]
set_load -pin_load -min 0.0014 [get_ports {out[18]}]
set_load -pin_load -max 0.32 [get_ports {out[18]}]
set_load -pin_load -min 0.0014 [get_ports {out[17]}]
set_load -pin_load -max 0.32 [get_ports {out[17]}]
set_load -pin_load -min 0.0014 [get_ports {out[16]}]
set_load -pin_load -max 0.32 [get_ports {out[16]}]
set_load -pin_load -min 0.0014 [get_ports {out[15]}]
set_load -pin_load -max 0.32 [get_ports {out[15]}]
set_load -pin_load -min 0.0014 [get_ports {out[14]}]
set_load -pin_load -max 0.32 [get_ports {out[14]}]
set_load -pin_load -min 0.0014 [get_ports {out[13]}]
set_load -pin_load -max 0.32 [get_ports {out[13]}]
set_load -pin_load -min 0.0014 [get_ports {out[12]}]
set_load -pin_load -max 0.32 [get_ports {out[12]}]
set_load -pin_load -min 0.0014 [get_ports {out[11]}]
set_load -pin_load -max 0.32 [get_ports {out[11]}]
set_load -pin_load -min 0.0014 [get_ports {out[10]}]
set_load -pin_load -max 0.32 [get_ports {out[10]}]
set_load -pin_load -min 0.0014 [get_ports {out[9]}]
set_load -pin_load -max 0.32 [get_ports {out[9]}]
set_load -pin_load -min 0.0014 [get_ports {out[8]}]
set_load -pin_load -max 0.32 [get_ports {out[8]}]
set_load -pin_load -min 0.0014 [get_ports {out[7]}]
set_load -pin_load -max 0.32 [get_ports {out[7]}]
set_load -pin_load -min 0.0014 [get_ports {out[6]}]
set_load -pin_load -max 0.32 [get_ports {out[6]}]
set_load -pin_load -min 0.0014 [get_ports {out[5]}]
set_load -pin_load -max 0.32 [get_ports {out[5]}]
set_load -pin_load -min 0.0014 [get_ports {out[4]}]
set_load -pin_load -max 0.32 [get_ports {out[4]}]
set_load -pin_load -min 0.0014 [get_ports {out[3]}]
set_load -pin_load -max 0.32 [get_ports {out[3]}]
set_load -pin_load -min 0.0014 [get_ports {out[2]}]
set_load -pin_load -max 0.32 [get_ports {out[2]}]
set_load -pin_load -min 0.0014 [get_ports {out[1]}]
set_load -pin_load -max 0.32 [get_ports {out[1]}]
set_load -pin_load -min 0.0014 [get_ports {out[0]}]
set_load -pin_load -max 0.32 [get_ports {out[0]}]
set_load -pin_load -min 0.0014 [get_ports done]
set_load -pin_load -max 0.32 [get_ports done]
set_false_path -from [get_ports reset]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[63]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[62]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[61]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[60]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[59]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[58]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[57]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[56]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[55]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[54]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[53]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[52]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[51]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[50]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[49]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[48]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[47]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[46]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[45]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[44]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[43]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[42]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[41]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[40]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[39]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[38]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[37]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[36]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[35]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[34]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[33]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[32]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports {in2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.2 [get_ports reset]
set_input_transition -min 0.003 [get_ports {in1[63]}]
set_input_transition -max 0.16 [get_ports {in1[63]}]
set_input_transition -min 0.003 [get_ports {in1[62]}]
set_input_transition -max 0.16 [get_ports {in1[62]}]
set_input_transition -min 0.003 [get_ports {in1[61]}]
set_input_transition -max 0.16 [get_ports {in1[61]}]
set_input_transition -min 0.003 [get_ports {in1[60]}]
set_input_transition -max 0.16 [get_ports {in1[60]}]
set_input_transition -min 0.003 [get_ports {in1[59]}]
set_input_transition -max 0.16 [get_ports {in1[59]}]
set_input_transition -min 0.003 [get_ports {in1[58]}]
set_input_transition -max 0.16 [get_ports {in1[58]}]
set_input_transition -min 0.003 [get_ports {in1[57]}]
set_input_transition -max 0.16 [get_ports {in1[57]}]
set_input_transition -min 0.003 [get_ports {in1[56]}]
set_input_transition -max 0.16 [get_ports {in1[56]}]
set_input_transition -min 0.003 [get_ports {in1[55]}]
set_input_transition -max 0.16 [get_ports {in1[55]}]
set_input_transition -min 0.003 [get_ports {in1[54]}]
set_input_transition -max 0.16 [get_ports {in1[54]}]
set_input_transition -min 0.003 [get_ports {in1[53]}]
set_input_transition -max 0.16 [get_ports {in1[53]}]
set_input_transition -min 0.003 [get_ports {in1[52]}]
set_input_transition -max 0.16 [get_ports {in1[52]}]
set_input_transition -min 0.003 [get_ports {in1[51]}]
set_input_transition -max 0.16 [get_ports {in1[51]}]
set_input_transition -min 0.003 [get_ports {in1[50]}]
set_input_transition -max 0.16 [get_ports {in1[50]}]
set_input_transition -min 0.003 [get_ports {in1[49]}]
set_input_transition -max 0.16 [get_ports {in1[49]}]
set_input_transition -min 0.003 [get_ports {in1[48]}]
set_input_transition -max 0.16 [get_ports {in1[48]}]
set_input_transition -min 0.003 [get_ports {in1[47]}]
set_input_transition -max 0.16 [get_ports {in1[47]}]
set_input_transition -min 0.003 [get_ports {in1[46]}]
set_input_transition -max 0.16 [get_ports {in1[46]}]
set_input_transition -min 0.003 [get_ports {in1[45]}]
set_input_transition -max 0.16 [get_ports {in1[45]}]
set_input_transition -min 0.003 [get_ports {in1[44]}]
set_input_transition -max 0.16 [get_ports {in1[44]}]
set_input_transition -min 0.003 [get_ports {in1[43]}]
set_input_transition -max 0.16 [get_ports {in1[43]}]
set_input_transition -min 0.003 [get_ports {in1[42]}]
set_input_transition -max 0.16 [get_ports {in1[42]}]
set_input_transition -min 0.003 [get_ports {in1[41]}]
set_input_transition -max 0.16 [get_ports {in1[41]}]
set_input_transition -min 0.003 [get_ports {in1[40]}]
set_input_transition -max 0.16 [get_ports {in1[40]}]
set_input_transition -min 0.003 [get_ports {in1[39]}]
set_input_transition -max 0.16 [get_ports {in1[39]}]
set_input_transition -min 0.003 [get_ports {in1[38]}]
set_input_transition -max 0.16 [get_ports {in1[38]}]
set_input_transition -min 0.003 [get_ports {in1[37]}]
set_input_transition -max 0.16 [get_ports {in1[37]}]
set_input_transition -min 0.003 [get_ports {in1[36]}]
set_input_transition -max 0.16 [get_ports {in1[36]}]
set_input_transition -min 0.003 [get_ports {in1[35]}]
set_input_transition -max 0.16 [get_ports {in1[35]}]
set_input_transition -min 0.003 [get_ports {in1[34]}]
set_input_transition -max 0.16 [get_ports {in1[34]}]
set_input_transition -min 0.003 [get_ports {in1[33]}]
set_input_transition -max 0.16 [get_ports {in1[33]}]
set_input_transition -min 0.003 [get_ports {in1[32]}]
set_input_transition -max 0.16 [get_ports {in1[32]}]
set_input_transition -min 0.003 [get_ports {in1[31]}]
set_input_transition -max 0.16 [get_ports {in1[31]}]
set_input_transition -min 0.003 [get_ports {in1[30]}]
set_input_transition -max 0.16 [get_ports {in1[30]}]
set_input_transition -min 0.003 [get_ports {in1[29]}]
set_input_transition -max 0.16 [get_ports {in1[29]}]
set_input_transition -min 0.003 [get_ports {in1[28]}]
set_input_transition -max 0.16 [get_ports {in1[28]}]
set_input_transition -min 0.003 [get_ports {in1[27]}]
set_input_transition -max 0.16 [get_ports {in1[27]}]
set_input_transition -min 0.003 [get_ports {in1[26]}]
set_input_transition -max 0.16 [get_ports {in1[26]}]
set_input_transition -min 0.003 [get_ports {in1[25]}]
set_input_transition -max 0.16 [get_ports {in1[25]}]
set_input_transition -min 0.003 [get_ports {in1[24]}]
set_input_transition -max 0.16 [get_ports {in1[24]}]
set_input_transition -min 0.003 [get_ports {in1[23]}]
set_input_transition -max 0.16 [get_ports {in1[23]}]
set_input_transition -min 0.003 [get_ports {in1[22]}]
set_input_transition -max 0.16 [get_ports {in1[22]}]
set_input_transition -min 0.003 [get_ports {in1[21]}]
set_input_transition -max 0.16 [get_ports {in1[21]}]
set_input_transition -min 0.003 [get_ports {in1[20]}]
set_input_transition -max 0.16 [get_ports {in1[20]}]
set_input_transition -min 0.003 [get_ports {in1[19]}]
set_input_transition -max 0.16 [get_ports {in1[19]}]
set_input_transition -min 0.003 [get_ports {in1[18]}]
set_input_transition -max 0.16 [get_ports {in1[18]}]
set_input_transition -min 0.003 [get_ports {in1[17]}]
set_input_transition -max 0.16 [get_ports {in1[17]}]
set_input_transition -min 0.003 [get_ports {in1[16]}]
set_input_transition -max 0.16 [get_ports {in1[16]}]
set_input_transition -min 0.003 [get_ports {in1[15]}]
set_input_transition -max 0.16 [get_ports {in1[15]}]
set_input_transition -min 0.003 [get_ports {in1[14]}]
set_input_transition -max 0.16 [get_ports {in1[14]}]
set_input_transition -min 0.003 [get_ports {in1[13]}]
set_input_transition -max 0.16 [get_ports {in1[13]}]
set_input_transition -min 0.003 [get_ports {in1[12]}]
set_input_transition -max 0.16 [get_ports {in1[12]}]
set_input_transition -min 0.003 [get_ports {in1[11]}]
set_input_transition -max 0.16 [get_ports {in1[11]}]
set_input_transition -min 0.003 [get_ports {in1[10]}]
set_input_transition -max 0.16 [get_ports {in1[10]}]
set_input_transition -min 0.003 [get_ports {in1[9]}]
set_input_transition -max 0.16 [get_ports {in1[9]}]
set_input_transition -min 0.003 [get_ports {in1[8]}]
set_input_transition -max 0.16 [get_ports {in1[8]}]
set_input_transition -min 0.003 [get_ports {in1[7]}]
set_input_transition -max 0.16 [get_ports {in1[7]}]
set_input_transition -min 0.003 [get_ports {in1[6]}]
set_input_transition -max 0.16 [get_ports {in1[6]}]
set_input_transition -min 0.003 [get_ports {in1[5]}]
set_input_transition -max 0.16 [get_ports {in1[5]}]
set_input_transition -min 0.003 [get_ports {in1[4]}]
set_input_transition -max 0.16 [get_ports {in1[4]}]
set_input_transition -min 0.003 [get_ports {in1[3]}]
set_input_transition -max 0.16 [get_ports {in1[3]}]
set_input_transition -min 0.003 [get_ports {in1[2]}]
set_input_transition -max 0.16 [get_ports {in1[2]}]
set_input_transition -min 0.003 [get_ports {in1[1]}]
set_input_transition -max 0.16 [get_ports {in1[1]}]
set_input_transition -min 0.003 [get_ports {in1[0]}]
set_input_transition -max 0.16 [get_ports {in1[0]}]
set_input_transition -min 0.003 [get_ports {in2[63]}]
set_input_transition -max 0.16 [get_ports {in2[63]}]
set_input_transition -min 0.003 [get_ports {in2[62]}]
set_input_transition -max 0.16 [get_ports {in2[62]}]
set_input_transition -min 0.003 [get_ports {in2[61]}]
set_input_transition -max 0.16 [get_ports {in2[61]}]
set_input_transition -min 0.003 [get_ports {in2[60]}]
set_input_transition -max 0.16 [get_ports {in2[60]}]
set_input_transition -min 0.003 [get_ports {in2[59]}]
set_input_transition -max 0.16 [get_ports {in2[59]}]
set_input_transition -min 0.003 [get_ports {in2[58]}]
set_input_transition -max 0.16 [get_ports {in2[58]}]
set_input_transition -min 0.003 [get_ports {in2[57]}]
set_input_transition -max 0.16 [get_ports {in2[57]}]
set_input_transition -min 0.003 [get_ports {in2[56]}]
set_input_transition -max 0.16 [get_ports {in2[56]}]
set_input_transition -min 0.003 [get_ports {in2[55]}]
set_input_transition -max 0.16 [get_ports {in2[55]}]
set_input_transition -min 0.003 [get_ports {in2[54]}]
set_input_transition -max 0.16 [get_ports {in2[54]}]
set_input_transition -min 0.003 [get_ports {in2[53]}]
set_input_transition -max 0.16 [get_ports {in2[53]}]
set_input_transition -min 0.003 [get_ports {in2[52]}]
set_input_transition -max 0.16 [get_ports {in2[52]}]
set_input_transition -min 0.003 [get_ports {in2[51]}]
set_input_transition -max 0.16 [get_ports {in2[51]}]
set_input_transition -min 0.003 [get_ports {in2[50]}]
set_input_transition -max 0.16 [get_ports {in2[50]}]
set_input_transition -min 0.003 [get_ports {in2[49]}]
set_input_transition -max 0.16 [get_ports {in2[49]}]
set_input_transition -min 0.003 [get_ports {in2[48]}]
set_input_transition -max 0.16 [get_ports {in2[48]}]
set_input_transition -min 0.003 [get_ports {in2[47]}]
set_input_transition -max 0.16 [get_ports {in2[47]}]
set_input_transition -min 0.003 [get_ports {in2[46]}]
set_input_transition -max 0.16 [get_ports {in2[46]}]
set_input_transition -min 0.003 [get_ports {in2[45]}]
set_input_transition -max 0.16 [get_ports {in2[45]}]
set_input_transition -min 0.003 [get_ports {in2[44]}]
set_input_transition -max 0.16 [get_ports {in2[44]}]
set_input_transition -min 0.003 [get_ports {in2[43]}]
set_input_transition -max 0.16 [get_ports {in2[43]}]
set_input_transition -min 0.003 [get_ports {in2[42]}]
set_input_transition -max 0.16 [get_ports {in2[42]}]
set_input_transition -min 0.003 [get_ports {in2[41]}]
set_input_transition -max 0.16 [get_ports {in2[41]}]
set_input_transition -min 0.003 [get_ports {in2[40]}]
set_input_transition -max 0.16 [get_ports {in2[40]}]
set_input_transition -min 0.003 [get_ports {in2[39]}]
set_input_transition -max 0.16 [get_ports {in2[39]}]
set_input_transition -min 0.003 [get_ports {in2[38]}]
set_input_transition -max 0.16 [get_ports {in2[38]}]
set_input_transition -min 0.003 [get_ports {in2[37]}]
set_input_transition -max 0.16 [get_ports {in2[37]}]
set_input_transition -min 0.003 [get_ports {in2[36]}]
set_input_transition -max 0.16 [get_ports {in2[36]}]
set_input_transition -min 0.003 [get_ports {in2[35]}]
set_input_transition -max 0.16 [get_ports {in2[35]}]
set_input_transition -min 0.003 [get_ports {in2[34]}]
set_input_transition -max 0.16 [get_ports {in2[34]}]
set_input_transition -min 0.003 [get_ports {in2[33]}]
set_input_transition -max 0.16 [get_ports {in2[33]}]
set_input_transition -min 0.003 [get_ports {in2[32]}]
set_input_transition -max 0.16 [get_ports {in2[32]}]
set_input_transition -min 0.003 [get_ports {in2[31]}]
set_input_transition -max 0.16 [get_ports {in2[31]}]
set_input_transition -min 0.003 [get_ports {in2[30]}]
set_input_transition -max 0.16 [get_ports {in2[30]}]
set_input_transition -min 0.003 [get_ports {in2[29]}]
set_input_transition -max 0.16 [get_ports {in2[29]}]
set_input_transition -min 0.003 [get_ports {in2[28]}]
set_input_transition -max 0.16 [get_ports {in2[28]}]
set_input_transition -min 0.003 [get_ports {in2[27]}]
set_input_transition -max 0.16 [get_ports {in2[27]}]
set_input_transition -min 0.003 [get_ports {in2[26]}]
set_input_transition -max 0.16 [get_ports {in2[26]}]
set_input_transition -min 0.003 [get_ports {in2[25]}]
set_input_transition -max 0.16 [get_ports {in2[25]}]
set_input_transition -min 0.003 [get_ports {in2[24]}]
set_input_transition -max 0.16 [get_ports {in2[24]}]
set_input_transition -min 0.003 [get_ports {in2[23]}]
set_input_transition -max 0.16 [get_ports {in2[23]}]
set_input_transition -min 0.003 [get_ports {in2[22]}]
set_input_transition -max 0.16 [get_ports {in2[22]}]
set_input_transition -min 0.003 [get_ports {in2[21]}]
set_input_transition -max 0.16 [get_ports {in2[21]}]
set_input_transition -min 0.003 [get_ports {in2[20]}]
set_input_transition -max 0.16 [get_ports {in2[20]}]
set_input_transition -min 0.003 [get_ports {in2[19]}]
set_input_transition -max 0.16 [get_ports {in2[19]}]
set_input_transition -min 0.003 [get_ports {in2[18]}]
set_input_transition -max 0.16 [get_ports {in2[18]}]
set_input_transition -min 0.003 [get_ports {in2[17]}]
set_input_transition -max 0.16 [get_ports {in2[17]}]
set_input_transition -min 0.003 [get_ports {in2[16]}]
set_input_transition -max 0.16 [get_ports {in2[16]}]
set_input_transition -min 0.003 [get_ports {in2[15]}]
set_input_transition -max 0.16 [get_ports {in2[15]}]
set_input_transition -min 0.003 [get_ports {in2[14]}]
set_input_transition -max 0.16 [get_ports {in2[14]}]
set_input_transition -min 0.003 [get_ports {in2[13]}]
set_input_transition -max 0.16 [get_ports {in2[13]}]
set_input_transition -min 0.003 [get_ports {in2[12]}]
set_input_transition -max 0.16 [get_ports {in2[12]}]
set_input_transition -min 0.003 [get_ports {in2[11]}]
set_input_transition -max 0.16 [get_ports {in2[11]}]
set_input_transition -min 0.003 [get_ports {in2[10]}]
set_input_transition -max 0.16 [get_ports {in2[10]}]
set_input_transition -min 0.003 [get_ports {in2[9]}]
set_input_transition -max 0.16 [get_ports {in2[9]}]
set_input_transition -min 0.003 [get_ports {in2[8]}]
set_input_transition -max 0.16 [get_ports {in2[8]}]
set_input_transition -min 0.003 [get_ports {in2[7]}]
set_input_transition -max 0.16 [get_ports {in2[7]}]
set_input_transition -min 0.003 [get_ports {in2[6]}]
set_input_transition -max 0.16 [get_ports {in2[6]}]
set_input_transition -min 0.003 [get_ports {in2[5]}]
set_input_transition -max 0.16 [get_ports {in2[5]}]
set_input_transition -min 0.003 [get_ports {in2[4]}]
set_input_transition -max 0.16 [get_ports {in2[4]}]
set_input_transition -min 0.003 [get_ports {in2[3]}]
set_input_transition -max 0.16 [get_ports {in2[3]}]
set_input_transition -min 0.003 [get_ports {in2[2]}]
set_input_transition -max 0.16 [get_ports {in2[2]}]
set_input_transition -min 0.003 [get_ports {in2[1]}]
set_input_transition -max 0.16 [get_ports {in2[1]}]
set_input_transition -min 0.003 [get_ports {in2[0]}]
set_input_transition -max 0.16 [get_ports {in2[0]}]
set_input_transition -min 0.003 [get_ports start]
set_input_transition -max 0.16 [get_ports start]
set_input_transition -min 0.003 [get_ports reset]
set_input_transition -max 0.16 [get_ports reset]
set_input_transition -min 0.003 [get_ports clk]
set_input_transition -max 0.16 [get_ports clk]
